   10  IDENTIFICATION DIVISION.
   20  PROGRAM-ID. HELLO-WORLD.
   30  DATA DIVISION.
   40  WORKING-STORAGE SECTION.
   50  PROCEDURE DIVISION.
   60  MAIN-LOGIC SECTION.
   70      BEGIN.
   80          DISPLAY "Hello, World!".
   90          STOP RUN.
   100     END PROGRAM HELLO-WORLD.
   